// ✅ 2.1. Реєстрація студента
// Користувач вводить: ім'я; прізвище; спеціальність; курс; середній бал.
// Вивести інформацію про студента у зрозумілому форматі, наприклад:
// ===== Профіль студента =====
// ПІБ: Петро Петренко
// Спеціальність: Комп'ютерні науки
// Курс: 2
// Середній бал: 91
// Визначити тип кожного введеного значення.
// 💡 Звернути увагу на те, який тип повертає prompt().
// 🌟 Bonus (за бажанням): вивести ці самі дані та фотографію студента на сторінку. Детальніше — у розділі Bonus нижче.

// ✅ 2.2. Доступ до курсу
// Доповнити програму.
// Дано три логічні змінні: isStudent; hasPaid; isMentor.
// Доступ до курсу надається, якщо користувач є ментором або є студентом, який оплатив навчання.
// Вивести повідомлення, чи має користувач доступ до курсу.

// ⭐ Challenge: 2.3. Сертифікат (за бажанням)
// Доповнити програму.
// Є змінна, яка містить відсоток виконання курсу.
// Студент отримує сертифікат тільки при повному проходженні курсу.
// Повідомити студента про можливість отримати сертифікат або вказати, скільки відсотків залишилося до завершення. Звертатися на ім'я.

const Name = (prompt("Type student`s name: "));
const surname = (prompt("Type student`s surname: "));
const specialisation = (prompt("Type student`s Specialisation: "));
const year = (prompt("Type student`s year: "));
const averageScore = (prompt("Type student`s Average score: "));

console.group("===== Student`s profile =====");
console.log("Name, Surname: ", Name, surname);
console.log('specialisation: ', specialisation );
console.log('Year: ', year);
console.log('averageScore: ', averageScore)
console.groupEnd();
